[

    {

        "Q": "What is React-Bootstrap?",
        "A": "It is a new and improved React",
        "B": "Is is a framework to run bootstrap in React",
        "C": "Adds functions to React to run smoother",
        "D": "It is the bootstrap library configured to run in React",
        "AS": "D",
        "P": 15,
        "kind": "Medium"

    },

    {

        "Q": "What is Bootstrap-CSS?",
        "A": "Library to add Math functions to Javascript",
        "B": "Strapping of boots",
        "C": "Framework made for CSS",
        "D": "It is the bootstrap library configured to run in CSS",
        "AS": "D",
        "P": 15,
        "kind": "Medium"

    },

    {

        "Q": "What is React-Typescript",
        "A": "It is a separate implementation of React completely different from React-JS",
        "B": "It is not a type-based language implementation of React library",
        "C": "It is a library in Typescript that is branched off of ReactJS, in which types are checked upon the compiling stage",
        "D": "Typescript is built from React",
        "AS": "C",
        "P": 5,
        "kind": "Easy"

    },

    {

        "Q": "What is a component in React?",
        "A": "A component is a part of the web page that is interactive or designed using React",
        "B": "A mechanical part",
        "C": "Component with only functionality of using the function useState and constructor",
        "D": "A part of React that only adds extra layer of class hierarchy",
        "AS": "A",
        "P": 10,
        "kind": "Easy"

    },

    {

        "Q": "What does useState do in React?",
        "A": "Uses the state of the class",
        "B": "Use state effectively as it would in the class-based react, state is used when the value will change, props is used when the value will not change",
        "C": "Creates a new component",
        "D": "Makes the whole entire class a new state",
        "AS": "B",
        "P": 20,
        "kind": "Hard"

    },

    {

        "Q": "What is the purposes of properties with React components?",
        "A": "Visual layout",
        "B": "Add extra values to the class",
        "C": "Make the class unique",
        "D": "The purpose of properties is to pass components values that will not change",
        "AS": "D",
        "P": 10,
        "kind": "medium"

    }


]